Revit 2027 API
Application.Documents Property
 Returns a set of documents within Revit.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual DocumentSet Documents { get; }
Public Overridable ReadOnly Property Documents As DocumentSet
	Get
public:
virtual property DocumentSet^ Documents {
	DocumentSet^ get ();
}
abstract Documents : DocumentSet with get
override Documents : DocumentSet with get
Property Value
DocumentSet
Remarks
 This property can be used for the user to find all the document inside Revit.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace